database-setup/PA_test/app/controllers/businesses_controller.rb

SELECT  "businesses".* FROM "businesses" WHERE "businesses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @business = Business.find(params[:id])

INSERT INTO "businesses" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Alina"], ["created_at", 2016-07-22 12:04:06 UTC], ["updated_at", 2016-07-22 12:04:06 UTC]]
---
  def create
    @business = Business.new(business_params)
    if @business.save

SELECT  "businesses".* FROM "businesses" WHERE "businesses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @business = Business.find(params[:id])

SELECT  "businesses".* FROM "businesses" WHERE "businesses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "businesses" SET "name" = ?, "updated_at" = ? WHERE "businesses"."id" = ?  [["name", "Ben"], ["updated_at", 2016-07-22 12:04:50 UTC], ["id", 1]]
---
  def update
    @business = Business.find(params[:id])
    if @business.update_attributes(business_params)