database-setup/PA_test/app/controllers/interactions_controller.rb

  def create
    @context = context
    @interaction = @context.interactions.new(interaction_params)
    if @interaction.save
---
INSERT INTO "interactions" ("description", "interactive_type", "interactive_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["description", "Hello this is a description"], ["interactive_type", "Business"], ["interactive_id", 1], ["created_at", 2016-07-22 12:07:34 UTC], ["updated_at", 2016-07-22 12:07:34 UTC]]

  def update
    @context = context
    @interaction = @context.interactions.find(params[:id])
    if @interaction.update_attributes(interaction_params)
---
UPDATE "interactions" SET "description" = ?, "updated_at" = ? WHERE "interactions"."id" = ?  [["description", "Hello this is an updated description"], ["updated_at", 2016-07-22 12:08:06 UTC], ["id", 1]]